# Написать цикл для выведения на экран каждой буквы своего ФИО.

fio = input("Введите текст: ")

for character in fio:
    print (character);